CSI API ETABS v1
cFrameObj.GetHingeAssigns_1 Method
 Retrieves frame object hinge assignments. The assignments include the hinge property, type, and location
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetHingeAssigns_1(
	string Name,
	ref int NumberHinges,
	ref int[] HingeNum,
	ref string[] Prop,
	ref int[] MyType,
	ref int[] Behavior,
	ref string[] Source,
	ref eHingeLocationType[] LocType,
	ref double[] RD,
	ref double[] AD
)
Function GetHingeAssigns_1 (
	Name As String,
	ByRef NumberHinges As Integer,
	ByRef HingeNum As Integer(),
	ByRef Prop As String(),
	ByRef MyType As Integer(),
	ByRef Behavior As Integer(),
	ByRef Source As String(),
	ByRef LocType As eHingeLocationType(),
	ByRef RD As Double(),
	ByRef AD As Double()
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim NumberHinges As Integer
Dim HingeNum As Integer()
Dim Prop As String()
Dim MyType As Integer()
Dim Behavior As Integer()
Dim Source As String()
Dim LocType As eHingeLocationType()
Dim RD As Double()
Dim AD As Double()
Dim returnValue As Integer
returnValue = instance.GetHingeAssigns_1(Name,
	NumberHinges, HingeNum, Prop, MyType,
	Behavior, Source, LocType, RD, AD)
int GetHingeAssigns_1(
	String^ Name,
	int% NumberHinges,
	array<int>^% HingeNum,
	array<String^>^% Prop,
	array<int>^% MyType,
	array<int>^% Behavior,
	array<String^>^% Source,
	array<eHingeLocationType>^% LocType,
	array<double>^% RD,
	array<double>^% AD
)
abstract GetHingeAssigns_1 :
        Name : string *
        NumberHinges : int byref *
        HingeNum : int[] byref *
        Prop : string[] byref *
        MyType : int[] byref *
        Behavior : int[] byref *
        Source : string[] byref *
        LocType : eHingeLocationType[] byref *
        RD : float[] byref *
        AD : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame object.
NumberHinges
Type: System.Int32
 The number of frame hinges assigned to the frame object.
HingeNum
Type: System.Int32[]
 An array of size NumberHinges. This is the hinge identification number.
Prop
Type: System.String[]
 An array of size NumberHinges. This is the name of the property of the hinge.
MyType
Type: System.Int32[]
 An array of size NumberHinges. This is a numeric value from 1 to 14 that specifies the type of the hinge.
P
V2
V3
T
M2
M3
Interacting P-M2
Interacting P-M3
Interacting M2-M3
Interacting P-M2-M3
Fiber P-M2-M3
Fiber P-M3
Parametric Concrete P-M2-M3
Parametric Steel P-M2-M3
Behavior
Type: System.Int32[]
 An array of size NumberHinges. This is a numeric value from 1 to 2 that specifies behavior of the hinge.
Force-controlled
Deformation-controlled
Source
Type: System.String[]
 An array of size NumberHinges. This is the name of the assigned hinge property, or "Auto" if an auto-generated hinge.
LocType
Type: ETABSv1.eHingeLocationType[]
 An array of size NumberHinges. This is a value from the eHingeLocationType enumeration, specifying the type used to define the location of the hinge.
RD
Type: System.Double[]
 An array of size NumberHinges. If LocType = RelativeDistance, this is the distance of the hinge from the end of the i-end offset, as a ratio to the clear length of the frame object.
AD
Type: System.Double[]
 An array of size NumberHinges. If LocType = OffsetFromIEnd, this is the absolute distance of the hinge from the end of the i-end offset. If LocType = OffsetFromJEnd, this is the absolute distance of the hinge from the end of the j-end offset.
Return Value
Type: Int32
 Returns zero if the hinge data is successfully retrieved, otherwise it returns a nonzero value.
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace